myblueraven/LPC11U_LPC13U_BSP/src/bspconfig.h
    CFG_BSP_PROTOCOL             If this field is defined the binary command
                              parser will be included
    -----------------------------------------------------------------------*/
    #define CFG_BSP_PROTOCOL

//    #define CFG_BSP_PROTOCOL_VIA_HID
     #define CFG_BSP_PROTOCOL_VIA_BULK

    #if defined(CFG_BSP_PROTOCOL) && !defined(CFG_BSP_PROTOCOL_VIA_HID) && !defined(CFG_BSP_PROTOCOL_VIA_BULK)
        #error CFG_BSP_PROTOCOL must be enabled with either CFG_BSP_PROTOCOL_VIA_HID or CFG_BSP_PROTOCOL_VIA_BULK
    #endif
/*=========================================================================*/

/*=========================================================================
    COMMAND LINE INTERFACE
    -----------------------------------------------------------------------

    CFG_BSP_CMDUART               If this field is defined the UART or USBCDC
                              based command-line interface will be included
    CFG_BSP_INTERFACE_MAXMSGSIZE  The maximum number of bytes to accept for an
                              incoming command
    CFG_BSP_INTERFACE_PROMPT      The command prompt to display at the start
                              of every new data entry line
    CFG_BSP_INTERFACE_SILENTMODE  If this is set to 1 only text generated in
                              response to commands will be send to the
                              output buffer.  The command prompt will not
                              be displayed and incoming text will not be
                              echoed back to the output buffer (allowing
                              you to see the text you have input).  This
                              is normally only desirable in a situation
                              where another MCU is communicating with
                              the LPC1343.
    CFG_BSP_INTERFACE_DROPCR      If this is set to 1 all incoming \r
                              characters will be dropped
    CFG_BSP_INTERFACE_ENABLEIRQ   If this is set to 1 the IRQ pin will be
                              set high when a command starts executing
                              and will go low when the command has
                              finished executing or the LCD is not busy.
                              This allows another device to know when a
                              new command can safely be sent.
    CFG_BSP_INTERFACE_IRQPORT     The gpio port for the IRQ/busy pin
    CFG_BSP_INTERFACE_IRQPIN      The gpio pin number for the IRQ/busy pin
    CFG_BSP_INTERFACE_SHORTERRORS If this is enabled only short 1 character
                              error messages will be returned (followed
                              by CFG_BSP_PRINTF_NEWLINE), rather than more
                              verbose error messages.  The specific
                              characters used are defined below.
    CFG_BSP_INTERFACE_CONFIRMREADY  If this is set to 1 a text confirmation
                              will be sent when the command prompt is
                              ready for a new command.  This is in
                              addition to CFG_BSP_INTERFACE_ENABLEIRQ if
                              this is also enabled.  The character used
                              is defined below.
    CFG_BSP_INTERFACE_LONGSYSINFO If this is set to 1 extra information will
                              be included in the Sys Info ('V') command
                              on the CLI. This can be useful when trying
                              to debug problems on remote HW, or with
                              unknown firmware.  It will also use about
                              0.5KB flash, though, so only enable it is
                              necessary.

    NOTE:                     The command-line interface will use either
                              USB-CDC or UART depending on whether
                              CFG_BSP_PRINTF_UART or CFG_BSP_PRINTF_USBCDC are
                              selected.
    -----------------------------------------------------------------------*/
    //#define CFG_BSP_CMDUART
    #define CFG_BSP_CMDUART_MAXMSGSIZE    (256)
    #define CFG_BSP_CMDUART_DROPCR        (0)
    #define CFG_BSP_CMDUART_ENABLEIRQ     (0)
    #define CFG_BSP_CMDUART_IRQPORT       (0)
    #define CFG_BSP_CMDUART_IRQPIN        (7)
    #define CFG_BSP_CMDUART_SHORTERRORS   (0)
    #define CFG_BSP_CMDUART_CONFIRMREADY  (0)
    #define CFG_BSP_CMDUART_LONGSYSINFO   (1)
/*=========================================================================*/


/*=========================================================================
    TFT LCD
    -----------------------------------------------------------------------

    CFG_BSP_TFTLCD                  If defined, this will cause drivers for
                                a pre-determined LCD screen to be included
                                during build.  Only one LCD driver can be
                                included during the build process (for ex.
                                'drivers/displays/hw/ILI9325.c')
    CFG_BSP_TFTLCD_INCLUDESMALLFONTS If set to 1, smallfont support will be
                                included for 3x6, 5x8, 7x8 and 8x8 fonts.
                                This should only be enabled if these small
                                fonts are required since there is already
                                support for larger fonts generated with
                                Dot Factory
                                http://www.pavius.net/downloads/tools/53-the-dot-factory
    CFG_BSP_TFTLCD_USEAAFONTS       If set to a non-zero value, anti-aliased
                                fonts will be used instead of regular 1-bit
                                font.  These result in much higher-
                                quality text, but the fonts are 2 or 4
                                times larger than plain bitmap fonts and
                                take a bit more rendering time to display.
    CFG_BSP_TFTLCD_TS_DEFAULTTHRESHOLD  Default minimum threshold to trigger a
                                touch event with the touch screen (and exit
                                from 'tsWaitForEvent' in touchscreen.c).
                                Should be an 8-bit value somewhere between
                                8 and 75 in normal circumstances.  This is
                                the default value and may be overriden by
                                a value stored in EEPROM.
    CFG_BSP_TFTLCD_TS_KEYPADDELAY   The delay in milliseconds between key
                                presses in dialogue boxes
    ----------------------------------------------------------------------*/
    #define CFG_BSP_TFTLCD
    #define CFG_BSP_TFTLCD_INCLUDESMALLFONTS   (0)
    #define CFG_BSP_TFTLCD_USEAAFONTS          (0)
    #define CFG_BSP_TFTLCD_TS_DEFAULTTHRESHOLD (50)
    #define CFG_BSP_TFTLCD_TS_KEYPADDELAY      (100)

	#ifdef CFG_BSP_TFTLCD
		#define CFG_BSP_LCD_ST7735
		//#define CFG_BSP_LCD_HX8340B
		//#define CFG_BSP_LCD_HX8347G
	#endif
/*=========================================================================*/


/*=========================================================================
    MICRO-SD CARD
    -----------------------------------------------------------------------

