myblueraven/LPC11U_LPC13U_BSP/src/bspconfig.h
    CFG_BSP_SDCARD                If this field is defined SD Card and FAT32
                              file system support will be included
    CFG_BSP_SDCARD_SPIPORT        SSP Port used for the SD card (0 or 1)
    CFG_BSP_SDCARD_READONLY       If this is set to 1, all commands to
                              write to the SD card will be removed
                              saving some flash space.
    CFG_BSP_SDCARD_CDPORT         The card detect port number
    CFG_BSP_SDCARD_CDPIN          The card detect pin number

    NOTE:                     All config settings for FAT32 are defined
                              in ffconf.h
    -----------------------------------------------------------------------*/
//    #define CFG_BSP_SDCARD
    #define CFG_BSP_SDCARD_READONLY         (0)   // Must be 0 or 1
    #define CFG_BSP_SDCARD_SPIPORT          (1)
    #define CFG_BSP_SDCARD_SSELPORT         (1)
    #define CFG_BSP_SDCARD_SSELPIN          (23)
    #define CFG_BSP_SDCARD_CDPORT           (0)
    #define CFG_BSP_SDCARD_CDPIN            (2)
    #define CFG_BSP_SDCARD_ENBLPORT         (0)
    #define CFG_BSP_SDCARD_ENBLPIN          (0)
    #define CFG_BSP_SDCARD_PRESENT_LEVEL    (0)   // If CD == Vcc when card present set to (1)

    #ifdef CFG_BSP_SDCARD
      #if !((CFG_BSP_SDCARD_READONLY == 0) || (CFG_BSP_SDCARD_READONLY == 1))
        #error "Invalid value for CFG_BSP_SDCARD_READONLY"
      #endif
      #if !((CFG_BSP_SDCARD_SPIPORT == 0) || (CFG_BSP_SDCARD_SPIPORT == 1))
        #error "Invalid SPI port for CFG_BSP_SDCARD_SPIPORT"
      #endif
    #endif
/*=========================================================================*/



/*=========================================================================
    RTC SUPPORT
    -----------------------------------------------------------------------

    CFG_BSP_RTC                     If defined, RTC support will be included.
                                Requires external HW.
    -----------------------------------------------------------------------*/
    // #define CFG_BSP_RTC

    #if defined(CFG_BSP_RTC) && !defined(CFG_BSP_ENABLE_I2C)
      #error "CFG_BSP_ENABLE_I2C must be defined with CFG_BSP_RTC"
    #endif
/*=========================================================================*/


/*=========================================================================
    USB

    CFG_BSP_USB_STRING_MANUFACTURER Manufacturer name that will appear in the
                                device descriptor during USB enumeration
    CFG_BSP_USB_STRING_PRODUCT      Product name that will appear in the
                                device descriptor during USB enumeration
    CFG_BSP_USB_VENDORID            16-bit USB vendor ID
    USB_PRODUCT_ID              Define this to set a custom product ID
                                if you do not wish to use the 'auto'
                                product ID feature
    CFG_BSP_CDC                     Enable USB CDC support
    CFG_BSP_USB_HID_KEYBOARD        Enable USB HID keyboard emulation
    CFG_BSP_USB_HID_MOUSE           Enable USB HID mouse emulation for a five
                                button 'Windows' mouse with scroll wheels
    CFG_BSP_USB_HID_GENERIC         Enable USB HID Generic support for custom
                                in and out reports, with report size set
                                via CFG_BSP_USB_HID_GENERIC_REPORT_SIZE
    CFG_BSP_USB_MSC                 Enable USB Mass Storage support, pointing
                                to the SD card reader (requires mmc.c from
                                the FATFS drivers, but doesn't use FATFS)


    You can combine more than one USB class below and they will be
    automatically combined in a USB composite device within the limit of
    available USB endpoints.  The USB Product ID is calculated automatically
    based on the combination of classes defined below.

    NOTE: Windows requires the .inf file in '/core/usb' for CDC support
    -----------------------------------------------------------------------*/
    #ifdef CFG_BSP_ENABLE_USB
      #define CFG_BSP_USB_STRING_MANUFACTURER       "ravendyne.com"
      #define CFG_BSP_USB_STRING_PRODUCT            "Servo Master - Ichi"
      #define CFG_BSP_USB_VENDORID                  (0x1FC9)

      #define CFG_BSP_USB_CDC

//       #define CFG_BSP_USB_HID_KEYBOARD
      // #define CFG_BSP_USB_HID_MOUSE
//      #define CFG_BSP_USB_HID_GENERIC
//      #define CFG_BSP_USB_HID_GENERIC_REPORT_SIZE (64)

//      #define CFG_BSP_USB_MSC

       #define CFG_BSP_USB_CUSTOM_CLASS

      #if (defined(CFG_BSP_USB_CDC)       || defined(CFG_BSP_USB_HID_KEYBOARD) || \
           defined(CFG_BSP_USB_HID_MOUSE) || defined(CFG_BSP_USB_HID_GENERIC)  || \
           defined(CFG_BSP_USB_MSC)       || defined(CFG_BSP_USB_CUSTOM_CLASS))
        #define CFG_BSP_USB
        #if defined(CFG_BSP_USB_HID_KEYBOARD) || defined(CFG_BSP_USB_HID_MOUSE) || defined(CFG_BSP_USB_HID_GENERIC)
          #define CFG_BSP_USB_HID
          #if defined(CFG_BSP_USB_HID_GENERIC) && (CFG_BSP_USB_HID_GENERIC_REPORT_SIZE > 64)
            #error "CFG_BSP_USB_HID_GENERIC_REPORT_SIZE exceeds the maximum value of 64 bytes (based on USB specs 2.0 for 'Full Speed Interrupt Endpoint Size')"
          #endif
        #endif
      #endif
    #endif
/*=========================================================================*/


/*=========================================================================
    CONFIG FILE VALIDATION

    Basic error checking to make sure that incompatible defines are not
    enabled at the same time, etc.

    -----------------------------------------------------------------------*/
    #if defined(CFG_BSP_INTERFACE) && !( defined CFG_BSP_PRINTF_UART || defined CFG_BSP_PRINTF_USBCDC || defined CFG_BSP_PRINTF_DEBUG)
      #error "At least one CFG_BSP_PRINTF target must be defined with CFG_BSP_INTERFACE"
    #endif

    #if defined(CFG_BSP_PRINTF_UART) && !defined(CFG_BSP_ENABLE_UART)
      #error "CFG_BSP_ENABLE_UART must be enabled with CFG_BSP_PRINTF_UART"
    #endif

    #if defined(CFG_BSP_PRINTF_USBCDC) && !defined(CFG_BSP_USB_CDC)
      #error "CFG_BSP_USB_CDC must be defined with CFG_BSP_PRINTF_USBCDC"
    #endif

    #if defined(CFG_BSP_USB_MSC) && !defined(CFG_BSP_SDCARD)
      #error "CFG_BSP_USB_MSC must be defined with CFG_BSP_SDCARD"
    #endif

    #if defined(CFG_BSP_PROTOCOL)
      #if defined(CFG_BSP_PROTOCOL_VIA_HID) && !defined(CFG_BSP_USB_HID_GENERIC)
        #error "CFG_BSP_PROTOCOL_VIA_HID requires CFG_BSP_USB_HID_GENERIC"
      #endif

      #if defined(CFG_BSP_PROTOCOL_VIA_BULK) && !defined(CFG_BSP_USB_CUSTOM_CLASS)
        #error "CFG_BSP_PROTOCOL_VIA_BULK requires CFG_BSP_USB_CUSTOM_CLASS to be defined"
      #endif
    #endif
/*=========================================================================*/

/*=========================================================================
    ENABLE Multi channel PWM

    -----------------------------------------------------------------------*/
//    #define CFG_BSP_MCPWM

/*=========================================================================*/

#ifdef __cplusplus
}
#endif

#endif
